bdbm_drv_new_version/run/fio/log/old_version/f/1_fio_f2048.txt
fio1: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio1: Laying out IO file(s) (1 file(s) / 1000MiB)

fio1: (groupid=0, jobs=1): err= 0: pid=4584: Tue Mar  7 17:40:49 2017
  write: IOPS=62.3k, BW=243MiB/s (255MB/s)(1000MiB/4110msec)
    slat (usec): min=3, max=399655, avg=15.02, stdev=1571.85
    clat (usec): min=0, max=401476, avg=1987.69, stdev=17726.88
     lat (usec): min=8, max=401490, avg=2002.71, stdev=17796.61
    clat percentiles (usec):
     |  1.00th=[  506],  5.00th=[  540], 10.00th=[  668], 20.00th=[  772],
     | 30.00th=[  812], 40.00th=[  852], 50.00th=[  908], 60.00th=[  964],
     | 70.00th=[ 1128], 80.00th=[ 1752], 90.00th=[ 2024], 95.00th=[ 2608],
     | 99.00th=[ 5088], 99.50th=[ 7648], 99.90th=[399360], 99.95th=[399360],
     | 99.99th=[403456]
    lat (usec) : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%, 500=0.09%, 750=17.93%, 1000=45.32%
    lat (msec) : 2=26.30%, 4=8.98%, 10=1.09%, 20=0.08%, 500=0.20%
  cpu          : usr=5.06%, sys=36.02%, ctx=117297, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=243MiB/s (255MB/s), 243MiB/s-243MiB/s (255MB/s-255MB/s), io=1000MiB (1049MB), run=4110-4110msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%