bdbm_drv_new_version/run/fio/log/old_version/f/3_fio_f2048.txt
fio3: (g=0): rw=write, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=libaio, iodepth=128
fio-2.17-37-g855f-dirty
Starting 1 process
fio3: Laying out IO file(s) (1 file(s) / 1000MiB)

fio3: (groupid=0, jobs=1): err= 0: pid=4532: Tue Mar  7 17:40:38 2017
  write: IOPS=22.9k, BW=89.5MiB/s (93.8MB/s)(1000MiB/11185msec)
    slat (usec): min=3, max=4984.4k, avg=43.05, stdev=10215.12
    clat (usec): min=1, max=4992.4k, avg=5548.66, stdev=115168.96
     lat (usec): min=12, max=4992.4k, avg=5591.71, stdev=115621.12
    clat percentiles (usec):
     |  1.00th=[  524],  5.00th=[  684], 10.00th=[  780], 20.00th=[  908],
     | 30.00th=[  964], 40.00th=[ 1012], 50.00th=[ 1064], 60.00th=[ 1240],
     | 70.00th=[ 1704], 80.00th=[ 1864], 90.00th=[ 2192], 95.00th=[ 2736],
     | 99.00th=[ 4896], 99.50th=[ 6496], 99.90th=[456704], 99.95th=[897024],
     | 99.99th=[5013504]
    lat (usec) : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
    lat (usec) : 500=0.01%, 750=8.59%, 1000=28.87%
    lat (msec) : 2=47.94%, 4=13.06%, 10=1.07%, 20=0.05%, 500=0.30%
    lat (msec) : 1000=0.05%, >=2000=0.05%
  cpu          : usr=1.72%, sys=14.38%, ctx=135263, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,256000,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=89.5MiB/s (93.8MB/s), 89.5MiB/s-89.5MiB/s (93.8MB/s-93.8MB/s), io=1000MiB (1049MB), run=11185-11185msec

Disk stats (read/write):
  robusta: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%